_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеСметаПлюс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ОбменДаннымиВФорматеСметаПлюс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_Файлы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ОбменДаннымиВФорматеСметаПлюс/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытий

// Заполнение Стройки и Организации из настроек пользователя.
&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Стройка = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяСтройка");	
	Объект.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяОрганизация");	
КонецПроцедуры

// Проверка возможности работать с 1984 годом.
&НаСервере
Функция ПолучитьВидимостьМетодика1984()
	
	Возврат(ПолучитьФункциональнуюОпцию("СМ_Методика84Года"));
	
КонецФункции	

// Установка значений реквизитов формы по умолчанию.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ИзФайла = Истина;
	ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Ложь;
	#Если ВебКлиент Тогда
		Элементы.ЗагрузкаКаталогАрхивов.Видимость = Ложь;
	#КонецЕсли
	ЭтаФорма.Методика1984 = Ложь;
    ЭтаФорма.Элементы.Методика1984.Видимость = ПолучитьВидимостьМетодика1984();
	ПриОткрытииНаСервере();
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		ИзФайла = Истина;
		КаталогАрхивов = Параметры.ИмяФайла; 
	КонецЕсли;
КонецПроцедуры

// Чистка временного каталога для загрузки архивов.
&НаКлиенте
Процедура ПриЗакрытии()
	
	// Синхронный вызов
	//ТекПапкаТемп 		= ЭтаФорма.ВременныйКаталог;
	//КаталогНаДиске 	= Новый Файл(ТекПапкаТемп);
	//Если КаталогНаДиске.Существует() Тогда
	//	УдалитьФайлы(ТекПапкаТемп);
	//КонецЕсли;

	// Замена на асинхронный вызов
	ТекПапкаТемп 	= ЭтаФорма.ВременныйКаталог;
	КаталогНаДиске 	= Новый Файл(ТекПапкаТемп);
	ОповещениеПроверкиКаталога = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиСуществованияКаталога", ЭтаФорма);
	КаталогНаДиске.НачатьПроверкуСуществования(ОповещениеПроверкиКаталога); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиСуществованияКаталога(Существует,ДополнительныеПараметры) Экспорт
	
	Если Существует Тогда
		ТекПапкаТемп 		= ЭтаФорма.ВременныйКаталог;
		ОповещениеУдаления 	= Новый ОписаниеОповещения("ВыполнитьПослеУдаления", ЭтаФорма);
		НачатьУдалениеФайлов(ОповещениеУдаления,ТекПапкаТемп); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеУдаления(ДополнительныеПараметры) Экспорт
	
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Файлы удалены'");
    Сообщение.Сообщить();
	
КонецПроцедуры

// Выбор каталога или одного файла архива, зависит от установленного флага "Из файла".
&НаКлиенте
Процедура ЗагрузкаКаталогАрхивовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Ложь;
	
	Если ИзФайла Тогда	
		Диалог 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ФильтрДляДиалога 	= "Архив (*.SMA)|*.SMA";
		ФильтрДляДиалога 	= ФильтрДляДиалога + "|Все файлы (*.*)|*.*";
		Диалог.Фильтр 		= ФильтрДляДиалога;
		// Синхронный вызов
		//Если Диалог.Выбрать() Тогда
		//	КаталогАрхивов = Диалог.ПолноеИмяФайла;
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
		Диалог.Показать(ОповещениеВыбора);
	Иначе
		Диалог 			= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Фильтр 	= "";
		// Синхронный вызов
		//Если Диалог.Выбрать() Тогда
		//	КаталогАрхивов = Диалог.Каталог;
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
		Диалог.Показать(ОповещениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			КаталогАрхивов = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Распаковка одного архивного файла из каталога.
&НаКлиенте
Функция Распаковка(ФайлАрхива)
	
	Если Не ЗначениеЗаполнено(ФайлАрхива) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нужно выбрать Файл архива для загрузки!'"));
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;	
	
	Результат = Истина;
	// Синхронный вызов
	// УдалитьФайлы(ВременныйКаталог, "*.*");
	
	// Замена на асинхронный вызов
	ОповещениеУдаления 	= Новый ОписаниеОповещения("ВыполнитьПослеУдаления", ЭтаФорма);
	НачатьУдалениеФайлов(ОповещениеУдаления,ВременныйКаталог,"*.*"); 
	
	Попытка 
		КопироватьФайл(ФайлАрхива,ВременныйКаталог+"\SAVE.ZIP") ;
	Исключение   
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка копирования файла архива'"));
	КонецПопытки; 
	
	Попытка
		Чтение = Новый ЧтениеZipФайла();
		Чтение.Открыть(ВременныйКаталог+"\SAVE.ZIP");
		#Если ВебКлиент Тогда
			Чтение.ИзвлечьВсе(ВременныйКаталог);
		#Иначе
			Чтение.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		#КонецЕсли
		Чтение.Закрыть();
		
		//// Синхронный вызов
		//ФайлСигнатюр = Новый Файл(ВременныйКаталог+"/SMETA75.SIG");
		//Если ФайлСигнатюр.Существует()= Ложь Тогда
		//	Сообщение 		= Новый СообщениеПользователю();
		//	Сообщение.Текст = НСтр("ru='Нет файла SMETA75.SIG!'");
		//	Сообщение.Сообщить();
		//	Результат = Ложь;
		//	Возврат(Результат);
		//Иначе	
		//	Текст 	= Новый ЧтениеТекста(ВременныйКаталог+"/SMETA75.SIG", КодировкаТекста.ANSI);
		//	Стр 	= Текст.ПрочитатьСтроку();
		//	Если Сред(Стр,1,20) = НСтр("ru='Архив для Смета Плюс'") Тогда
		//		НовыйАрхив = Ложь;
		//		// Строки читаются до символа перевода строки
		//		Пока Стр <> Неопределено Цикл 
		//			Стр = Текст.ПрочитатьСтроку();
		//			Если Стр = НСтр("ru='Архив для Смета 1C, Версия 3'") Тогда
		//				НовыйАрхив = Истина;
		//			КонецЕсли;
		//		КонецЦикла;
		//		ЭтаФорма.НовыйАрхив = НовыйАрхив;
		//	КонецЕсли;
		//КонецЕсли;

		//ФайлСметы = Новый Файл(ВременныйКаталог+"/SMETA.DBF");
		//Если ФайлСметы.Существует()= Ложь Тогда
		//	Сообщение 		= Новый СообщениеПользователю();
		//	Сообщение.Текст = НСтр("ru='Нет файла SMETA.DBF!'");
		//	Сообщение.Сообщить();
		//	Результат = Ложь;
		//	Возврат(Результат);
		//КонецЕсли;
		
		// Замена на асинхронный вызов
		ФайлСигнатюр = Новый Файл(ВременныйКаталог+"/SMETA75.SIG");
		ОповещениеПроверкиФайлСигнатур = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиСуществованияФайлаСигнатур", ЭтаФорма);
		ФайлСигнатюр.НачатьПроверкуСуществования(ОповещениеПроверкиФайлСигнатур); 
	Исключение 
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка извлечения архива'"));
	КонецПопытки; 
	
	Возврат(Результат);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеПроверкиСуществованияФайлаСигнатур(Существует,ДополнительныеПараметры) Экспорт
	
	Если Существует Тогда
		Текст 	= Новый ЧтениеТекста(ВременныйКаталог+"/SMETA75.SIG", КодировкаТекста.ANSI);
		Стр 	= Текст.ПрочитатьСтроку();
		// Строки читаются до символа перевода строки
		Если Сред(Стр,1,20) = НСтр("ru='Архив для Смета Плюс'") Тогда
			НовыйАрхив = Ложь;
			Пока Стр <> Неопределено Цикл 
				Стр = Текст.ПрочитатьСтроку();
				Если Стр = НСтр("ru='Архив для Смета 1C, Версия 3'") Тогда
					НовыйАрхив = Истина;
				КонецЕсли;
			КонецЦикла;
			ЭтаФорма.НовыйАрхив = НовыйАрхив;
		КонецЕсли;
		
		// Замена на асинхронный вызов
		ФайлСметы = Новый Файл(ВременныйКаталог+"/SMETA.DBF");
		ОповещениеПроверкиФайлСметы = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиСуществованияФайлаСметы", ЭтаФорма);
		ФайлСметы.НачатьПроверкуСуществования(ОповещениеПроверкиФайлСметы); 
	Иначе	
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла SMETA75.SIG!'");
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиСуществованияФайлаСметы(Существует,ДополнительныеПараметры) Экспорт

	Если НЕ Существует Тогда
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла SMETA.DBF!'");
		Сообщение.Сообщить();
	КонецЕсли;
		
КонецПроцедуры

// Загрузка одного или нескольких выбранных файлов из каталога архивов смет.
&НаКлиенте
Процедура ЗагрузитьАрхив(Команда)
	МассивХранилищ.Очистить();
	АнализФайла = ПроверитьСоответствиеЛЗ();
	Если  АнализФайла = Истина Тогда
		Для Каждого ТекФайлАрхива Из СписокСметКаталога Цикл 
			Если ТекФайлАрхива.Загружать Тогда
				Если Распаковка(ТекФайлАрхива.АрхивСметы) Тогда
					СобратьФайлыВоВременноеХранилище(ТекФайлАрхива.АрхивСметы);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьВыполнениеЗадания",1,Истина);

	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Требуется заполнить соответствия лимитированных затрат'"));
	КонецЕсли;
	Если этаформа.ВладелецФормы <> Неопределено Тогда
		Если этаформа.ВладелецФормы.ИмяФормы = "Обработка.СМ_ДеревоСмет.Форма.ФормаУпр" Тогда
			этаформа.ВладелецФормы.Элементы.СписокОбъектыСтроительства.обновить()
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьВыполнениеЗадания()
	
	Результат 				= ЗапуститьЗадание();
	ИдентификаторЗадания 	= Результат.ИдентификаторЗадания;
	АдресХранилища 		 	= Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ОбработкаРезультата();
		Оповестить("ОбновитьДеревоСмет");
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Результат.ИдентификаторЗадания);
	КонецЕсли;  		
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				ОбработкаРезультата();
				Оповестить("ОбновитьДеревоСмет");
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",ПараметрыОбработчикаОжидания.ТекущийИнтервал,Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ЗаписатьИсключениеНаСервере(ПредставлениеОшибки);
		ПоказатьПредупреждение(,НСтр("ru='Произошла ошибка. Подробности в журнале регистрации.'"));
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
Функция ЗапуститьЗадание()
	СтруктураПараметров = Новый Структура;

	Возврат Обработки.СМ_ОбменДаннымиВФорматеСметаПлюс.ЗапуститьЗагрузкаАрхива(ЭтаФорма,СтруктураПараметров);
	
КонецФункции

&НаСервере
Процедура ОбработкаРезультата()
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаИмен Из МассивХранилищ Цикл 
		ИмяФайла = СтрокаИмен.ИмяФайла;
		ИмяФайлаИнд = СтрокаИмен.ИмяФайла + "Инд";
		Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ИмяФайла)); 
		Если Запись.Следующий() Тогда
			Запись.ПолучитьМенеджерЗаписи().Удалить();
		КонецЕсли;
		Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ИмяФайлаИнд)); 
		Если Запись.Следующий() Тогда
			Запись.ПолучитьМенеджерЗаписи().Удалить();
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекСтрока Из РезультатВыполнения.ТабСообщения Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ТекСтрока.ТекстСообщения);		
	КонецЦикла;

	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Загрузка завершена!'"));

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)

	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ЗаписатьИсключениеНаСервере(Знач ПредставлениеОшибки)
	
	Событие = НСтр("ru = 'Ошибка в задании'");
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПредставлениеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьФайлыВоВременноеХранилище(АрхивСметы)
	
	// **********************************************************************
	// Проверка файлов ДБФ 
	Если НЕ ЗначениеЗаполнено(ВременныйКаталог) Тогда
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Каталог / файл загрузки не указан!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВременныйКаталог) Тогда
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Каталог с файлами архивов не создан!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// **********************************************************************
	// Файл Сметы
	ФайлСметы 						= Новый Файл(ВременныйКаталог+"/SMETA.DBF");
	ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"/SMETA.DBF");
	АдресВременногоХранилищаСмета 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	СтрокаМассива 					= МассивХранилищ.Добавить();
	СтрокаМассива.ИмяАрхива 		= АрхивСметы;
	СтрокаМассива.ИмяФайла 			= "ФайлСмета";
	СтрокаМассива.АдресФайла 		= АдресВременногоХранилищаСмета;
	
	// **********************************************************************
	// Проверка файла раздела	
	//ФайлРаздел = Новый Файл(ВременныйКаталог+"\RAZEXT.DBF");
	//Если ФайлРаздел.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла RAZEXT.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"\RAZEXT.DBF");
	//АдресВременногоХранилищаРаздел 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 					= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 			= АрхивСметы;
	//СтрокаМассива.ИмяФайла 			= "ИндексыРаздела";
	//СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаРаздел;

	//ФайлИндексыРаздела 				= Новый Файл(ВременныйКаталог+"\RAZEXT.CDX");
	//ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"\RAZEXT.CDX");
	//АдресВременногоХранилищаРазделИнд = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 		= АдресВременногоХранилищаРазделИнд;
	
	// Замена на асинхронный вызов
	ФайлРаздел = Новый Файл(ВременныйКаталог+"\RAZEXT.DBF");
	ОповещениеПроверкиФайлаРаздела = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаРаздела", ЭтаФорма, АрхивСметы);
	ФайлРаздел.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаРаздела); 	
	
	// **********************************************************************
	// Проверка файла позиции
	//ФайлПозиция = Новый Файл(ВременныйКаталог+"/POSEXT.DBF");
	//Если ФайлПозиция.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла POSEXT.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSEXT.DBF");
	//АдресВременногоХранилищаПозиция 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 						= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 				= АрхивСметы;
	//СтрокаМассива.ИмяФайла 				= "ФайлПоз"; 
	//СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаПозиция;
	//ФайлПозицияИнд 						= Новый Файл(ВременныйКаталог+"/POSEXT.CDX");
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSEXT.CDX");
	//АдресВременногоХранилищаПозицияИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 			= АдресВременногоХранилищаПозицияИнд;
	
	// Замена на асинхронный вызов
	ФайлПозиция = Новый Файл(ВременныйКаталог+"/POSEXT.DBF");
	ОповещениеПроверкиФайлаПозиции = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаПозиции", ЭтаФорма, АрхивСметы);
	ФайлПозиция.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаПозиции); 
	
	// **********************************************************************
	// Проверка файла Параметры
	//ФайлЧППозиция = Новый Файл(ВременныйКаталог+"/PARAMS.DBF");
	//Если ФайлЧППозиция.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла PARAMS.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/PARAMS.DBF");
	//АдресВременногоХранилищаЧППозиция 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 						= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 				= АрхивСметы;
	//СтрокаМассива.ИмяФайла 				= "ФайлЧП"; 
	//СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаЧППозиция;
	//ФайлЧППозицияИнд 						= Новый Файл(ВременныйКаталог+"/PARAMS.CDX");
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/PARAMS.CDX");
	//АдресВременногоХранилищаЧППозицияИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 			= АдресВременногоХранилищаЧППозицияИнд;
	
	// Замена на асинхронный вызов
	ФайлЧППозиция = Новый Файл(ВременныйКаталог+"/PARAMS.DBF");
	ОповещениеПроверкиФайлаПараметры = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаПараметры", ЭтаФорма, АрхивСметы);
	ФайлЧППозиция.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаПараметры); 
	
	// **********************************************************************
	// Проверка файла Ресурсы
	//ФайлРесурсы = Новый Файл(ВременныйКаталог+"/RESTBL.DBF");
	//Если ФайлРесурсы.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла RESTBL.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/RESTBL.DBF");
	//АдресВременногоХранилищаРесурсы 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 						= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 				= АрхивСметы;
	//СтрокаМассива.ИмяФайла 				= "ФайлРес"; 
	//СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаРесурсы;
	//ФайлРесурсыИнд 						= Новый Файл(ВременныйКаталог+"/RESTBL.CDX");
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/RESTBL.CDX");
	//АдресВременногоХранилищаРесурсыИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 			= АдресВременногоХранилищаРесурсыИнд;
	
	// Замена на асинхронный вызов
	ФайлРесурсы = Новый Файл(ВременныйКаталог+"/RESTBL.DBF");
	ОповещениеПроверкиФайлаРесурсы = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаРесурсы", ЭтаФорма, АрхивСметы);
	ФайлРесурсы.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаРесурсы); 
	
	// **********************************************************************
	// Проверка файла связка
	//ФайлСвязка = Новый Файл(ВременныйКаталог+"/POSTOOLS.DBF");
	//Если ФайлСвязка.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла POSTOOLS.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSTOOLS.DBF");
	//АдресВременногоХранилищаСвязка 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 						= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 				= АрхивСметы;
	//СтрокаМассива.ИмяФайла 				= "ФайлИндексовРесурсов"; 
	//СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаСвязка;
	//ФайлСвязкаИнд 						= Новый Файл(ВременныйКаталог+"/POSTOOLS.CDX");
	//ДвоичныеДанные						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSTOOLS.CDX");
	//АдресВременногоХранилищаСвязкаИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 			= АдресВременногоХранилищаСвязкаИнд;
	
	// Замена на асинхронный вызов
	ФайлСвязка = Новый Файл(ВременныйКаталог+"/POSTOOLS.DBF");
	ОповещениеПроверкиФайлаСвязка = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаСвязка", ЭтаФорма, АрхивСметы);
	ФайлСвязка.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаСвязка); 
	
	// **********************************************************************
	// Проверка файла лим.затраты	
	//ФайлЛЗ = Новый Файл(ВременныйКаталог+"/LIMZTR.DBF");
	//Если ФайлЛЗ.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла LIMZTR.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/LIMZTR.DBF");
	//АдресВременногоХранилищаЛимЗатраты 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 						= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 				= АрхивСметы;
	//СтрокаМассива.ИмяФайла 				= "ФайлЛимЗатр"; 
	//СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаЛимЗатраты;
	
	// Замена на асинхронный вызов
	ФайлЛЗ = Новый Файл(ВременныйКаталог+"/LIMZTR.DBF");
	ОповещениеПроверкиФайлаЛимЗатрат = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаЛимЗатрат", ЭтаФорма, АрхивСметы);
	ФайлЛЗ.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаЛимЗатрат); 	
	
	// **********************************************************************
	// Проверка файла акта
	//ФайлАкт = Новый Файл(ВременныйКаталог+"/ACTS.DBF");
	//Если ФайлАкт.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла ACTS.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 				= Новый ДвоичныеДанные(ВременныйКаталог+"/ACTS.DBF");
	//АдресВременногоХранилищаАкт 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 				= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 		= АрхивСметы;
	//СтрокаМассива.ИмяФайла 		= "Акт"; 
	//СтрокаМассива.АдресФайла 		= АдресВременногоХранилищаАкт;

	// Замена на асинхронный вызов
	ФайлАкт = Новый Файл(ВременныйКаталог+"/ACTS.DBF");
	ОповещениеПроверкиФайлаАкт = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаАкта", ЭтаФорма, АрхивСметы);
	ФайлАкт.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаАкт); 	
	
	// **********************************************************************
	// Проверка файла расход ресурсов акта
	//ФайлРасходРесурсовАкт = Новый Файл(ВременныйКаталог+"/RASTBL.DBF");
	//Если ФайлРасходРесурсовАкт.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла RASTBL.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 								= Новый ДвоичныеДанные(ВременныйКаталог+"/RASTBL.DBF");
	//АдресВременногоХранилищаРасходРесурсовАкт 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 								= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 						= АрхивСметы;
	//СтрокаМассива.ИмяФайла						= "Расход"; 
	//СтрокаМассива.АдресФайла 						= АдресВременногоХранилищаРасходРесурсовАкт;

	//ФайлРасходРесурсовАктИнд 						= Новый Файл(ВременныйКаталог+"/RASTBL.CDX");
	//ДвоичныеДанные								= Новый ДвоичныеДанные(ВременныйКаталог+"/RASTBL.CDX");
	//АдресВременногоХранилищаРасходРесурсовАктИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 					= АдресВременногоХранилищаРасходРесурсовАктИнд;

	// Замена на асинхронный вызов
	ФайлРасходРесурсовАкт = Новый Файл(ВременныйКаталог+"/RASTBL.DBF");
	ОповещениеПроверкиФайлаРасходРесурсовАкта = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаРасходРесурсовАкта", ЭтаФорма, АрхивСметы);
	ФайлРасходРесурсовАкт.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаРасходРесурсовАкта); 		
	
	// **********************************************************************
	// Проверка файла выполнения акта
	//ФайлВыполнениеАкт = Новый Файл(ВременныйКаталог+"/EXECUTE.DBF");
	//Если ФайлВыполнениеАкт.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла EXECUTE.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 							= Новый ДвоичныеДанные(ВременныйКаталог+"/EXECUTE.DBF");
	//АдресВременногоХранилищаВыполнение 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 							= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива					= АрхивСметы;
	//СтрокаМассива.ИмяФайла 					= "Выполнение"; 
	//СтрокаМассива.АдресФайла 					= АдресВременногоХранилищаВыполнение;

	//ФайлВыполнениеАктИнд 						= Новый Файл(ВременныйКаталог+"/EXECUTE.CDX");
	//ДвоичныеДанные 							= Новый ДвоичныеДанные(ВременныйКаталог+"/EXECUTE.CDX");
	//АдресВременногоХранилищаВыполнениеАктИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива.ИндексныйФайл 				= АдресВременногоХранилищаВыполнениеАктИнд;

	// Замена на асинхронный вызов
	ФайлВыполнениеАкт = Новый Файл(ВременныйКаталог+"/EXECUTE.DBF");
	ОповещениеПроверкиФайлаВыполненияАкта = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаВыполненияАкта", ЭтаФорма, АрхивСметы);
	ФайлВыполнениеАкт.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаВыполненияАкта); 	

	// **********************************************************************
	// Проверка файла подписи
	//ФайлПодписи  = Новый Файл(ВременныйКаталог+"\SIGNS.DBF");
	//Если ФайлПодписи.Существует()= Ложь Тогда
	//	Сообщение 		= Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru='Нет файла SIGNS.DBF!'");
	//	Сообщение.Сообщить();
	//	Возврат;
	//КонецЕсли;
	//
	//ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"\SIGNS.DBF");
	//АдресВременногоХранилищаПодписи 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
	//СтрокаМассива 					= МассивХранилищ.Добавить();
	//СтрокаМассива.ИмяАрхива 			= АрхивСметы;
	//СтрокаМассива.ИмяФайла 			= "Подписи"; 
	//СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаПодписи;

	// Замена на асинхронный вызов
	ФайлПодписи  = Новый Файл(ВременныйКаталог+"\SIGNS.DBF");
	ОповещениеПроверкиФайлаПодписи = Новый ОписаниеОповещения("ВыполнитьПослеПроверкиФайлаПодписи", ЭтаФорма, АрхивСметы);
	ФайлПодписи.НачатьПроверкуСуществования(ОповещениеПроверкиФайлаПодписи); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаРаздела(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"\RAZEXT.DBF");
		АдресВременногоХранилищаРаздел 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 					= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 		= АрхивСметы;
		СтрокаМассива.ИмяФайла 			= "ИндексыРаздела";
		СтрокаМассива.АдресФайла 		= АдресВременногоХранилищаРаздел;

		ФайлИндексыРаздела 					= Новый Файл(ВременныйКаталог+"\RAZEXT.CDX");
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"\RAZEXT.CDX");
		АдресВременногоХранилищаРазделИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 		= АдресВременногоХранилищаРазделИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла RAZEXT.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаПозиции(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSEXT.DBF");
		АдресВременногоХранилищаПозиция 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 						= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 			= АрхивСметы;
		СтрокаМассива.ИмяФайла 				= "ФайлПоз"; 
		СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаПозиция;
		ФайлПозицияИнд 						= Новый Файл(ВременныйКаталог+"/POSEXT.CDX");
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSEXT.CDX");
		АдресВременногоХранилищаПозицияИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 		= АдресВременногоХранилищаПозицияИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла POSEXT.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаПараметры(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 							= Новый ДвоичныеДанные(ВременныйКаталог+"/PARAMS.DBF");
		АдресВременногоХранилищаЧППозиция 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 							= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 				= АрхивСметы;
		СтрокаМассива.ИмяФайла 					= "ФайлЧП"; 
		СтрокаМассива.АдресФайла 				= АдресВременногоХранилищаЧППозиция;
		ФайлЧППозицияИнд 						= Новый Файл(ВременныйКаталог+"/PARAMS.CDX");
		ДвоичныеДанные 							= Новый ДвоичныеДанные(ВременныйКаталог+"/PARAMS.CDX");
		АдресВременногоХранилищаЧППозицияИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 			= АдресВременногоХранилищаЧППозицияИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла PARAMS.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаРесурсы(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/RESTBL.DBF");
		АдресВременногоХранилищаРесурсы 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 						= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 			= АрхивСметы;
		СтрокаМассива.ИмяФайла 				= "ФайлРес"; 
		СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаРесурсы;
		ФайлРесурсыИнд 						= Новый Файл(ВременныйКаталог+"/RESTBL.CDX");
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/RESTBL.CDX");
		АдресВременногоХранилищаРесурсыИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 		= АдресВременногоХранилищаРесурсыИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла RESTBL.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаСвязка(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSTOOLS.DBF");
		АдресВременногоХранилищаСвязка 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 						= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 			= АрхивСметы;
		СтрокаМассива.ИмяФайла 				= "ФайлИндексовРесурсов"; 
		СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаСвязка;
		ФайлСвязкаИнд 						= Новый Файл(ВременныйКаталог+"/POSTOOLS.CDX");
		ДвоичныеДанные						= Новый ДвоичныеДанные(ВременныйКаталог+"/POSTOOLS.CDX");
		АдресВременногоХранилищаСвязкаИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 		= АдресВременногоХранилищаСвязкаИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла POSTOOLS.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаЛимЗатрат(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 						= Новый ДвоичныеДанные(ВременныйКаталог+"/LIMZTR.DBF");
		АдресВременногоХранилищаЛимЗатраты 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 						= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 			= АрхивСметы;
		СтрокаМассива.ИмяФайла 				= "ФайлЛимЗатр"; 
		СтрокаМассива.АдресФайла 			= АдресВременногоХранилищаЛимЗатраты;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла LIMZTR.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаАкта(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 				= Новый ДвоичныеДанные(ВременныйКаталог+"/ACTS.DBF");
		АдресВременногоХранилищаАкт = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 				= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 	= АрхивСметы;
		СтрокаМассива.ИмяФайла 		= "Акт"; 
		СтрокаМассива.АдресФайла 	= АдресВременногоХранилищаАкт;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла ACTS.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаРасходРесурсовАкта(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 									= Новый ДвоичныеДанные(ВременныйКаталог+"/RASTBL.DBF");
		АдресВременногоХранилищаРасходРесурсовАкт 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 									= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 						= АрхивСметы;
		СтрокаМассива.ИмяФайла							= "Расход"; 
		СтрокаМассива.АдресФайла 						= АдресВременногоХранилищаРасходРесурсовАкт;

		ФайлРасходРесурсовАктИнд 						= Новый Файл(ВременныйКаталог+"/RASTBL.CDX");
		ДвоичныеДанные									= Новый ДвоичныеДанные(ВременныйКаталог+"/RASTBL.CDX");
		АдресВременногоХранилищаРасходРесурсовАктИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 					= АдресВременногоХранилищаРасходРесурсовАктИнд;
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла RASTBL.DBF!'");
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаВыполненияАкта(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 								= Новый ДвоичныеДанные(ВременныйКаталог+"/EXECUTE.DBF");
		АдресВременногоХранилищаВыполнение 			= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 								= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива						= АрхивСметы;
		СтрокаМассива.ИмяФайла 						= "Выполнение"; 
		СтрокаМассива.АдресФайла 					= АдресВременногоХранилищаВыполнение;

		ФайлВыполнениеАктИнд 						= Новый Файл(ВременныйКаталог+"/EXECUTE.CDX");
		ДвоичныеДанные 								= Новый ДвоичныеДанные(ВременныйКаталог+"/EXECUTE.CDX");
		АдресВременногоХранилищаВыполнениеАктИнд 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива.ИндексныйФайл 				= АдресВременногоХранилищаВыполнениеАктИнд;	
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла EXECUTE.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПроверкиФайлаПодписи(Существует,АрхивСметы) Экспорт
	
	Если Существует Тогда
		ДвоичныеДанные 					= Новый ДвоичныеДанные(ВременныйКаталог+"\SIGNS.DBF");
		АдресВременногоХранилищаПодписи = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор); 
		СтрокаМассива 					= МассивХранилищ.Добавить();
		СтрокаМассива.ИмяАрхива 		= АрхивСметы;
		СтрокаМассива.ИмяФайла 			= "Подписи"; 
		СтрокаМассива.АдресФайла 		= АдресВременногоХранилищаПодписи;		
	Иначе
		Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла SIGNS.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

КонецПроцедуры

// Создание таблицы лимитированных затрат. 
// Таблицы файлов архивов с наименованиями смет, входящих в архивы.
&НаКлиенте
Процедура ОпределитьСоответствиеЛЗ(Команда)
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОпределитьСоответствиеЛЗ", ЭтаФорма);
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОпределитьСоответствиеЛЗ(ИмяКаталогаВременныхФайлов,ДополнительныеПараметры) Экспорт
	
	СписокСметКаталога.Очистить();
	АнализФайла 				= Ложь;
	ЭтаФорма.ВременныйКаталог 	= "";
	ПрефиксВремени  			= СтрЗаменить(ТекущаяУниверсальнаяДатаВМиллисекундах(),":",".");
	ТекПапкаТемп 				= ИмяКаталогаВременныхФайлов+"arh_sm_"+ИмяПользователя()+"_" + ПрефиксВремени;
	ВременныйКаталог 			= ТекПапкаТемп;
	
	//КаталогНаДиске = Новый Файл(ВременныйКаталог);
	//Если КаталогНаДиске.Существует()= Ложь Тогда
	//	СоздатьКаталог(ВременныйКаталог);
	//КонецЕсли;
	//
	//Если ИзФайла = Истина Тогда
	//	Если Распаковка(КаталогАрхивов)  Тогда
	//		//  Загрузить ЛЗ в таблицу соответствий.
	//		НеНайдено = 0;
	//		ДобавитьЛЗДляСоответствий(НеНайдено);
	//		НоваяСтрока 			= СписокСметКаталога.Добавить();
	//		НоваяСтрока.АрхивСметы 	= КаталогАрхивов;
	//		НоваяСтрока.Загружать 	= Истина;
	//		НоваяСтрока.Наименование = НайтиНаименованиеАрхива();
	//		
	//		Если Ненайдено = 0 Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Все лимитированные затраты найдены!'"));
	//		Иначе
	//			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
	//		КонецЕсли;
	//		ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Истина;
	//	КонецЕсли;	
	//Иначе
	//	НеНайдено = 0;
	//	Если ЗначениеЗаполнено(Этаформа.КаталогАрхивов) Тогда
	//		СписокФайлов = НайтиФайлы(Этаформа.КаталогАрхивов,"*.SMA"); 
	//		Для Каждого ТекФайл Из СписокФайлов Цикл
	//			Если Распаковка(ТекФайл.ПолноеИмя)  Тогда
	//				//  Загрузить ЛЗ в таблицу соответствий.
	//				НоваяСтрока 			= СписокСметКаталога.Добавить();
	//				НоваяСтрока.АрхивСметы 	= ТекФайл.ПолноеИмя;
	//				НоваяСтрока.Загружать 	= Истина;
	//				НоваяСтрока.Наименование = НайтиНаименованиеАрхива();
	//				ДобавитьЛЗДляСоответствий(НеНайдено);
	//			КонецЕсли;	
	//		КонецЦикла;
	//		Если Ненайдено = 0 Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Все лимитированные затраты найдены!'"));
	//		Иначе
	//			Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
	//		КонецЕсли;
	//		ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Истина;
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен каталог архивов!'"));
	//	КонецЕсли;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	КаталогНаДиске = Новый Файл(ВременныйКаталог);
	ОповещениеПроверкиКаталога = Новый ОписаниеОповещения("ПослеПроверкиСуществованияКаталога", ЭтаФорма, ИмяКаталогаВременныхФайлов);
	КаталогНаДиске.НачатьПроверкуСуществования(ОповещениеПроверкиКаталога); 		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияКаталога(Существует,ИмяКаталогаВременныхФайлов) Экспорт
	
	Если НЕ Существует Тогда
		ПрефиксВремени  			= СтрЗаменить(ТекущаяУниверсальнаяДатаВМиллисекундах(),":",".");
		ТекПапкаТемп 				= ИмяКаталогаВременныхФайлов+"arh_sm_"+ИмяПользователя()+"_" + ПрефиксВремени;
		ВременныйКаталог 			= ТекПапкаТемп;
		СоздатьКаталог(ВременныйКаталог);
	КонецЕсли;
	
	Если ИзФайла = Истина Тогда
		//  Загрузить ЛЗ в таблицу соответствий.
		Если Распаковка(КаталогАрхивов)  Тогда
			НеНайдено = 0;
			ДобавитьЛЗДляСоответствий(НеНайдено);
			НоваяСтрока 			= СписокСметКаталога.Добавить();
			НоваяСтрока.АрхивСметы 	= КаталогАрхивов;
			НоваяСтрока.Загружать 	= Истина;
			НоваяСтрока.Наименование = НайтиНаименованиеАрхива();
			
			Если Ненайдено = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Все лимитированные затраты найдены!'"));
			Иначе
				Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
			КонецЕсли;
			ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Истина;
		КонецЕсли;	
	Иначе
		НеНайдено = 0;
		Если ЗначениеЗаполнено(Этаформа.КаталогАрхивов) Тогда
			ОповещениеПоиска = Новый ОписаниеОповещения("ВыполнитьПослеПоискаФайлов", ЭтотОбъект);
			НачатьПоискФайлов(ОповещениеПоиска,Этаформа.КаталогАрхивов,"*.SMA");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен каталог архивов!'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПоискаФайлов(НайденныеФайлы,ДополнительныеПараметры) Экспорт
	
	НеНайдено = 0;
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		Если Распаковка(ТекФайл)  Тогда
			НоваяСтрока 			= СписокСметКаталога.Добавить();
			НоваяСтрока.АрхивСметы 	= ТекФайл.ПолноеИмя;
			НоваяСтрока.Загружать 	= Истина;
			НоваяСтрока.Наименование = НайтиНаименованиеАрхива();
			ДобавитьЛЗДляСоответствий(НеНайдено);
		КонецЕсли;	
	КонецЦикла;
	
	Если Ненайдено = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Все лимитированные затраты найдены!'"));
	Иначе
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.ТаблицыДанных;
	КонецЕсли;
	ЭтаФорма.Элементы.ЗагрузитьАрхив.Доступность = Истина;	
	
КонецПроцедуры

// Проверка, есть ли строки в таблице СоответствияЛЗ строк с признаком "загружать" истина.
// Не найденных в справочнике.
&НаКлиенте
Функция ПроверитьСоответствиеЛЗ()
	Результат = Истина;
	Для каждого Стр Из СоответствияЛЗ Цикл
		Если Стр.СсылкаВБазе.Пустая() И Стр.Загружать = Истина Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат(Результат);
КонецФункции

// Определение наименования главной сметы в принимаемом архиве.
Функция НайтиНаименованиеАрхива()
	Наименование = "";
	ФайлСметы = Новый Файл(Этаформа.ВременныйКаталог+"/SMETA.DBF");
	ФайлНаименованияСметы = Новый XBase;
	ФайлНаименованияСметы.ОткрытьФайл(ФайлСметы.ПолноеИмя,,Истина); 
	Если НЕ ФайлНаименованияСметы.Открыта() Тогда
		Возврат Наименование;
	КонецЕсли;
	ФайлНаименованияСметы.Первая();
	Наименование = СокрЛП(ФайлНаименованияСметы.ПолучитьЗначениеПоля("NAME"));
	ФайлНаименованияСметы.ЗакрытьФайл();
	Возврат Наименование;
КонецФункции

#КонецОбласти

#Область СозданиеДокументов

// Определение соответствия ЛЗ из файла LIMZTR.DBF в справочнике Лимитированные затраты. 
// Занесение в таблицу СоответствияЛЗ не найденных ЛЗ.
Процедура ДобавитьЛЗДляСоответствий(НеНайдено)
	ФайлЛЗ = Новый Файл(Этаформа.ВременныйКаталог+"/LIMZTR.DBF");
	Если ФайлЛЗ.Существует()= Ложь Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Нет файла LIMZTR.DBF!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	ФайлЛимЗатр = Новый XBase;
	ФайлЛимЗатр.ОткрытьФайл(ФайлЛЗ.ПолноеИмя,,Истина); 
	Если НЕ ФайлЛимЗатр.Открыта() Тогда
		Возврат;
	КонецЕсли;
	ФайлЛимЗатр.Первая();
	Пока Не ФайлЛимЗатр.ВКонце() Цикл
		Наименование = СокрЛП(ФайлЛимЗатр.ПолучитьЗначениеПоля("NAME"));
		ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(Наименование);
		Если ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка() Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("НаименованиеЛЗ",Наименование);
			Строки =  СоответствияЛЗ.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда 
				НоваяСтрока 				= СоответствияЛЗ.Добавить();
				НоваяСтрока.НаименованиеЛЗ 	= Наименование;
				НоваяСтрока.Загружать 	= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Лимитированная затрата: %1 не найдена в справочнике.'"), Наименование));
				НеНайдено = 1;
			КонецЕсли;
		КонецЕсли;
	    ФайлЛимЗатр.Следующая();
	КонецЦикла;	
	ФайлЛимЗатр.ЗакрытьФайл();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Для Каждого СтрокаТабл Из СписокСметКаталога Цикл
		СтрокаТабл.Загружать = Ложь;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
Для Каждого СтрокаТабл Из СписокСметКаталога Цикл
		СтрокаТабл.Загружать = Истина;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствияЛЗ

&НаКлиенте
Процедура СоответствияЛЗСсылкаВБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПолучитьЛимитированныеЗатраты", ЭтотОбъект);
	ОткрытьФорму("Справочник.СМ_ЛимитированныеЗатраты.Форма.ФормаВыбораБезПомеченныхНаУдаление",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЛимитированныеЗатраты(Результат, Структура) Экспорт
	
	Элементы.СоответствияЛЗ.ТекущиеДанные.СсылкаВБазе = Результат;

КонецПроцедуры

#КонецОбласти
